docs/docker.docu.org
#
#
#
#+OPTIONS: toc:3
#
#
#


* Overview
** Purpose
This paper documents the Proof of Concept Project as described in the Scope of Work written by Elemica:
Enable a Jenkins build server to publish release artifacts as Docker images to a Docker registry. Start
service on a new EC2 node by fetching the artifact from the registry.
** Author
 - Author: Michael Klöckner, Weberstr. 39, 60318 Frankfurt am Main, 
 - Email:mkl@im7.de
 - Phone: +49 69 9866 1103
* Installing docker
This installation guide is take from the [[http://docs.docer.io/en/latest/][Docker documentation]].
** Kernel options
Docker needs a 64-Bit Linux distribution, a recent kernel > 3.8 and LXC
installed. Either you use a system with the appropriate kernel installed, or
you update the kernel by hand as described in kernel compilation. The ker-
nel needs to have compiled all options concerning virtual NICs, especially
BRIDGED NICs, all NAT options and all net  ( NF ) options. Download
the kernel source, untar it, change into the directory and configure it prop-
erly. To compile the kernel as a debian package named *fora-kernel-3.13.3*
to be installed later together with it's header follow these instructions:
#+BEGIN_SRC sh
make-kpkg clean
make-kpkg --append-to-version "-flora-kernel-3.13.3" --revision "1" \
--initrd kernel_image kernel_headers
#+END_SRC
The package is to be found one directory upwards and can be installed using
#+BEGIN_SRC sh
dpkg -i ../linux-headers-3.13.3-flora-kernel-3.13.3_1.2_amd64.deb \
../linux-image-3.13.3-flora-kernel-3.13.3_1.2_amd64.deb/.
#+END_SRC
*** By Hand
First add the Docker repository key to your local keychain.
#+BEGIN_SRC sh
sudo apt-key adv --keyserver keyserver.ubuntu.com \
--recv-keys 36A1D7869245C8950F966E92D8576A8BA88D21E9
#+END_SRC
Add the Docker repository to your apt sources list, update and install
the lxc-docker package.
#+BEGIN_SRC sh
sudo sh -c "echo deb http://get.docker.io/ubuntu docker main\
> /etc/apt/sources.list.d/docker.list"
sudo apt-get update
sudo apt-get install lxc-docker
#+END_SRC
Now verify that the installation has worked by downloading the ubuntu
image and launching a container. =sudo docker run -i -t ubuntu /bin/bash=.
Type exit to exit.
*** Installation Script
Docker.io provides an installation script to be called: =curl -s https://get.docker.io/ubuntu/ | sudo sh=
Now verify that the installation has worked by downloading the ubuntu
image and launching a container. =sudo docker run -i -t ubuntu /bin/bash=
Type exit to exit.
*** AWS
Docker.io provides an installation guide for Amazon Web Services EC2.
- Choose an image: 
  + Launch the Create Instance Wizard menu on your AWS Console.
  + Click the Select button for a 64Bit Ubuntu image. For example: Ubuntu Server 12.04.3 LTS. 
  + For testing you can use the default (possibly free) t1.micro instance (more info on pricing). 
  + Click the Next: Configure Instance Details button at the bottom right.
- Tell CloudInit to install Docker:
  + When you're on the Configure Instance Details step, expand the Advanced Details section.
  + Under User data, select As text
 + Enter =#include https://get.docker.io = into the instance User Data. CloudInit is part of the Ubuntu image you chose; it will bootstrap Docker by running the shell script located at this URL.
- After a few more standard choices where defaults are probably ok, your AWS Ubuntu instance with Docker should be running!
If this is your first AWS instance, you may need to set up your Security Group to allow SSH. By default all incoming ports to your new instance will be blocked by the AWS Security Group, so you might just get
timeouts when you try to connect. Installing with get.docker.io (as above) will create a service named lxc-
docker. It will also set up a docker group and you may want to add the ubuntu user to it so that you don't have to use sudo for every Docker command.
** Play with docker
*** Check your Docker installation.
#+BEGIN_SRC bash
# Check that you have a working install
docker info
#+END_SRC 
*** Download a pre-built image
#+BEGIN_SRC bash
# Download an ubuntu image
sudo docker pull ubuntu
#+END_SRC
*** Run an interactive shell
#+BEGIN_SRC bash
# Run an interactive shell in the ubuntu image,
# allocate a tty, attach stdin and stdout
# To detach the tty without exiting the shell,
# use the escape sequence Ctrl-p + Ctrl-q
sudo docker run -i -t ubuntu /bin/bash
#+END_SRC
*** Bind to a port
The Docker client can use -H to connect to a custom port.
-H accepts host and port assignment in the following format: 
- tcp://[host][:port]  =
- unix://path =
- host[:port] or :port =

#+BEGIN_SRC bash
# Run docker in daemon mode
sudo <path to>/docker -H 0.0.0.0:5555 -d &
# Download an ubuntu image
sudo docker -H :5555 pull ubuntu
#+END_SRC
