docs/docker.docu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>docker.docu</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="docker.docu"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-02-19 18:26:26 CET"/>
<meta name="author" content="Michael Klöckner"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">docker.docu</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview</a>
<ul>
<li><a href="#sec-1-1">1.1 Purpose</a></li>
<li><a href="#sec-1-2">1.2 Author</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Installing docker</a>
<ul>
<li><a href="#sec-2-1">2.1 Kernel options</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 By Hand</a></li>
<li><a href="#sec-2-1-2">2.1.2 Installation Script</a></li>
<li><a href="#sec-2-1-3">2.1.3 AWS</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 Play with docker</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 Check your Docker installation.</a></li>
<li><a href="#sec-2-2-2">2.2.2 Download a pre-built image</a></li>
<li><a href="#sec-2-2-3">2.2.3 Run an interactive shell</a></li>
<li><a href="#sec-2-2-4">2.2.4 Bind to a port</a></li>
<li><a href="#sec-2-2-5">2.2.5 Starting a long run</a></li>
<li><a href="#sec-2-2-6">2.2.6 Bind a service on a TCP port</a></li>
<li><a href="#sec-2-2-7">2.2.7 Committing (saving) a container state</a></li>
<li><a href="#sec-2-2-8">2.2.8 Committing a Container to a Named Image</a></li>
<li><a href="#sec-2-2-9">2.2.9 Pushing an image to its repository</a></li>
<li><a href="#sec-2-2-10">2.2.10 Private Repositories</a></li>
<li><a href="#sec-2-2-11">2.2.11 Export a container</a></li>
<li><a href="#sec-2-2-12">2.2.12 Import a container</a></li>
<li><a href="#sec-2-2-13">2.2.13 Authentication file</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 Build your own base image</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 Download the script</a></li>
<li><a href="#sec-2-3-2">2.3.2 Build the base image</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Installing a <i>Scala/Java</i> WebApp</a>
<ul>
<li><a href="#sec-3-1">3.1 Installing <i>Java</i> and <i>Lift</i></a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 The necessary debian packages</a></li>
<li><a href="#sec-3-1-2">3.1.2 check if we need apache packages?</a></li>
<li><a href="#sec-3-1-3">3.1.3 Scala WebApp</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 Installing <i>tomcat7</i></a></li>
<li><a href="#sec-3-3">3.3 Deploying the WebApp to <i>tomcat7</i></a></li>
</ul>
</li>
<li><a href="#sec-4">4 Installing Jenkinsx</a></li>
<li><a href="#sec-5">5 Configure Jenkins to publish a container into the registry</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Purpose</h3>
<div class="outline-text-3" id="text-1-1">

<p>This paper documents the Proof of Concept Project as described in the Scope of Work written by Elemica:
Enable a Jenkins build server to publish release artifacts as Docker images to a Docker registry. Start
service on a new EC2 node by fetching the artifact from the registry.
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Author</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>Author: Michael Klöckner, Weberstr. 39, 60318 Frankfurt am Main, 
</li>
<li>Email:mkl@im7.de
</li>
<li>Phone: +49 69 9866 1103
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installing docker</h2>
<div class="outline-text-2" id="text-2">

<p>This installation guide is take from the <a href="http://docs.docer.io/en/latest/">Docker documentation</a>.
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Kernel options</h3>
<div class="outline-text-3" id="text-2-1">

<p>Docker needs a 64-Bit Linux distribution, a recent kernel &gt; 3.8 and LXC
installed. Either you use a system with the appropriate kernel installed, or
you update the kernel by hand as described in kernel compilation. The ker-
nel needs to have compiled all options concerning virtual NICs, especially
BRIDGED NICs, all NAT options and all net  ( NF ) options. Download
the kernel source, untar it, change into the directory and configure it prop-
erly. To compile the kernel as a debian package named <b>fora-kernel-3.13.3</b>
to be installed later together with it's header follow these instructions:
</p>


<pre class="src src-sh">make-kpkg clean
make-kpkg --append-to-version <span style="color: #8b2252;">"-flora-kernel-3.13.3"</span> --revision <span style="color: #8b2252;">"1"</span> <span style="color: #8b2252;">\</span>
--initrd kernel_image kernel_headers
</pre>

<p>
The package is to be found one directory upwards and can be installed using
</p>


<pre class="src src-sh">dpkg -i ../linux-headers-3.13.3-flora-kernel-3.13.3_1.2_amd64.deb <span style="color: #8b2252;">\</span>
../linux-image-3.13.3-flora-kernel-3.13.3_1.2_amd64.deb/.
</pre>


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> By Hand</h4>
<div class="outline-text-4" id="text-2-1-1">

<p>First add the Docker repository key to your local keychain.
</p>


<pre class="src src-sh">sudo apt-key adv --keyserver keyserver.ubuntu.com <span style="color: #8b2252;">\</span>
--recv-keys 36A1D7869245C8950F966E92D8576A8BA88D21E9
</pre>

<p>
Add the Docker repository to your apt sources list, update and install
the lxc-docker package.
</p>


<pre class="src src-sh">sudo sh -c <span style="color: #8b2252;">"echo deb http://get.docker.io/ubuntu docker main\</span>
<span style="color: #8b2252;">&gt; /etc/apt/sources.list.d/docker.list"</span>
sudo apt-get update
sudo apt-get install lxc-docker
</pre>

<p>
Now verify that the installation has worked by downloading the ubuntu
image and launching a container. <code>sudo docker run -i -t ubuntu /bin/bash</code>.
Type exit to exit.
</p></div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Installation Script</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>Docker.io provides an installation script to be called: <code>curl -s https://get.docker.io/ubuntu/ | sudo sh</code>
Now verify that the installation has worked by downloading the ubuntu
image and launching a container. <code>sudo docker run -i -t ubuntu /bin/bash</code>
Type exit to exit.
</p></div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> AWS</h4>
<div class="outline-text-4" id="text-2-1-3">

<p>Docker.io provides an installation guide for Amazon Web Services EC2.
</p><ul>
<li>Choose an image: 
<ul>
<li>Launch the Create Instance Wizard menu on your AWS Console.
</li>
<li>Click the Select button for a 64Bit Ubuntu image. For example: Ubuntu Server 12.04.3 LTS. 
</li>
<li>For testing you can use the default (possibly free) t1.micro instance (more info on pricing). 
</li>
<li>Click the Next: Configure Instance Details button at the bottom right.
</li>
</ul>

</li>
<li>Tell CloudInit to install Docker:
<ul>
<li>When you're on the Configure Instance Details step, expand the Advanced Details section.
</li>
<li>Under User data, select As text
</li>
<li>Enter =#include <a href="https://get.docker.io">https://get.docker.io</a> = into the instance User Data. CloudInit is part of the Ubuntu image you chose; it will bootstrap Docker by running the shell script located at this URL.
</li>
</ul>

</li>
<li>After a few more standard choices where defaults are probably ok, your AWS Ubuntu instance with Docker should be running!
</li>
</ul>

<p>If this is your first AWS instance, you may need to set up your Security Group to allow SSH. By default all incoming ports to your new instance will be blocked by the AWS Security Group, so you might just get
timeouts when you try to connect. Installing with get.docker.io (as above) will create a service named lxc-
docker. It will also set up a docker group and you may want to add the ubuntu user to it so that you don't have to use sudo for every Docker command.
</p></div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Play with docker</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Check your Docker installation.</h4>
<div class="outline-text-4" id="text-2-2-1">




<pre class="src src-bash"># Check that you have a working install
docker info
</pre>

</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Download a pre-built image</h4>
<div class="outline-text-4" id="text-2-2-2">




<pre class="src src-bash"># Download an ubuntu image
sudo docker pull ubuntu
</pre>

</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Run an interactive shell</h4>
<div class="outline-text-4" id="text-2-2-3">




<pre class="src src-bash"># Run an interactive shell in the ubuntu image,
# allocate a tty, attach stdin and stdout
# To detach the tty without exiting the shell,
# use the escape sequence Ctrl-p + Ctrl-q
sudo docker run -i -t ubuntu /bin/bash
</pre>

</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Bind to a port</h4>
<div class="outline-text-4" id="text-2-2-4">

<p>The Docker client can use -H to connect to a custom port.
-H accepts host and port assignment in the following format: 
</p><ul>
<li>tcp://[host][:port]  =
</li>
<li>unix://path =
</li>
<li>host[:port] or :port =
</li>
</ul>





<pre class="src src-bash"># Run docker in daemon mode
sudo &lt;path to&gt;/docker -H 0.0.0.0:5555 -d &amp;
# Download an ubuntu image
sudo docker -H :5555 pull ubuntu
</pre>

</div>

</div>
