docs/docker.docu.html

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> Starting a long run</h4>
<div class="outline-text-4" id="text-2-2-5">




<pre class="src src-bash"># Start a very useful long-running process
JOB=$(sudo docker run -d ubuntu /bin/sh -c <span style="color: #8b2252;">"while true; \</span>
<span style="color: #8b2252;">do echo Hello world; sleep 1; done"</span>)
# Collect the output of the job so far
sudo docker logs $JOB
# Kill the job
sudo docker kill $JOB
</pre>

</div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> Bind a service on a TCP port</h4>
<div class="outline-text-4" id="text-2-2-6">




<pre class="src src-bash"># Bind port 4444 of this container, and tell netcat to listen on it
JOB=$(sudo docker run -d -p 4444 ubuntu:12.10 /bin/nc -l 4444)

# Which public port is NATed to my container?
PORT=$(sudo docker port $JOB 4444 | awk -F: '{ print $2 }')

# Connect to the public port
echo hello world | nc 127.0.0.1 $PORT

# Verify that the network connection worked
echo <span style="color: #8b2252;">"Daemon received: $(sudo docker logs $JOB)"</span>
</pre>


</div>

</div>

<div id="outline-container-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> Committing (saving) a container state</h4>
<div class="outline-text-4" id="text-2-2-7">


<p>
Save your containers state to a container image, so the state can be re-used.
</p>
<p>
When you commit your container only the differences between the image the container was created from and the current state of the container will be stored (as a diff). See which images you already have using the docker images command.
</p>


<pre class="src src-bash"># Commit your container to a new named image
sudo docker commit &lt;container_id&gt; &lt;some_name&gt;

# List your containers
sudo docker images
</pre>


</div>

</div>

<div id="outline-container-2-2-8" class="outline-4">
<h4 id="sec-2-2-8"><span class="section-number-4">2.2.8</span> Committing a Container to a Named Image</h4>
<div class="outline-text-4" id="text-2-2-8">

<p>When you make changes to an existing image, those changes get saved to a container’s file system. You can then promote that container to become an image by making a commit. In addition to converting the container to an image, this is also your opportunity to name the image, specifically a name that includes your user name from the Central Docker Index (as you did a login above) and a meaningful name for the image.
</p>


<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">format is "sudo docker commit &lt;container_id&gt; &lt;username&gt;/&lt;imagename&gt;"</span>
$ sudo docker commit $<span style="color: #a0522d;">CONTAINER_ID</span> myname/kickassapp
</pre>

</div>

</div>

<div id="outline-container-2-2-9" class="outline-4">
<h4 id="sec-2-2-9"><span class="section-number-4">2.2.9</span> Pushing an image to its repository</h4>
<div class="outline-text-4" id="text-2-2-9">

<p>In order to push an image to its repository you need to have committed your container to a named image (see above).
Now you can commit this image to the repository designated by its name or tag.
</p>


<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">format is "docker push &lt;username&gt;/&lt;repo_name&gt;"</span>
$ sudo docker push myname/kickassapp
</pre>


</div>

</div>

<div id="outline-container-2-2-10" class="outline-4">
<h4 id="sec-2-2-10"><span class="section-number-4">2.2.10</span> Private Repositories</h4>
<div class="outline-text-4" id="text-2-2-10">

<p>Right now (version 0.6), private repositories are only possible by hosting <a href="https://github.com/dotcloud/docker-registry">your private registry</a>. To push or pull to a repository on your own registry, you must prefix the tag with the address of the registry’s host, like this:
</p>


<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Tag to create a repository with the full registry location.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">The location (e.g. localhost.localdomain:5000) becomes</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">a permanent part of the repository name</span>
sudo docker tag 0u812deadbeef localhost.localdomain:5000/repo_name
<span style="color: #b22222;"># </span><span style="color: #b22222;">Push the new repository to its home location on localhost</span>
sudo docker push localhost.localdomain:5000/repo_name
</pre>

<p>
Once a repository has your registry’s host name as part of the tag, you can push and pull it like any other repository, but it will not be searchable (or indexed at all) in the Central Index, and there will be no user name checking performed. Your registry will function completely independently from the Central Index.
</p></div>

</div>

<div id="outline-container-2-2-11" class="outline-4">
<h4 id="sec-2-2-11"><span class="section-number-4">2.2.11</span> Export a container</h4>
<div class="outline-text-4" id="text-2-2-11">

<p>To export a container to a tar file just type:
</p>


<pre class="src src-sh">$ docker images
REPOSITORY          TAG                 IMAGE ID            CREATED             VIRTUAL SIZE
mkl/debian          7.4                 11ed3d47ec89        About an hour ago   117.8 MB
mkl/debian          latest              11ed3d47ec89        About an hour ago   117.8 MB
mkl/debian          wheezy              11ed3d47ec89        About an hour ago   117.8 MB
ubuntu              13.10               9f676bd305a4        2 weeks ago         182.1 MB
ubuntu              saucy               9f676bd305a4        2 weeks ago         182.1 MB

$ docker ps -a
CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS              PORTS               NAMES
ac3a595c294c        mkl/debian:7.4      /bin/bash           58 minutes ago      Exit 1                                  prickly_lovelace    
f7528d270208        mkl/debian:7.4      echo success        About an hour ago   Exit 0                                  jovial_pare         
6a569d77e974        ubuntu:12.04        /bin/bash           16 hours ago        Exit 0                                  backstabbing_pike 

$ docker export ac3a595c294c  &gt; exampleimage.tar
</pre>

</div>

</div>

<div id="outline-container-2-2-12" class="outline-4">
<h4 id="sec-2-2-12"><span class="section-number-4">2.2.12</span> Import a container</h4>
<div class="outline-text-4" id="text-2-2-12">

<p>At this time, the URL must start with http and point to a single file archive (.tar, .tar.gz, .tgz, .bzip, .tar.xz, or .txz) containing a root filesystem. If you would like to import from a local directory or archive, you can use the - parameter to take the data from stdin.
To import from a remote url type:
</p>


<pre class="src src-sh">$ sudo docker import http://example.com/exampleimage.tar
</pre>

<p>
To import from a local file type:
</p>


<pre class="src src-sh">$ cat exampleimage.tar | sudo docker import - exampleimagelocal:new
</pre>

<p>
Note the sudo in this example – you must preserve the ownership of the files (especially root ownership) during the archiving with tar. If you are not root (or the sudo command) when you tar, then the ownerships might not get preserved.
</p></div>

</div>

<div id="outline-container-2-2-13" class="outline-4">
<h4 id="sec-2-2-13"><span class="section-number-4">2.2.13</span> Authentication file</h4>
<div class="outline-text-4" id="text-2-2-13">


<p>
The authentication is stored in a json file, .dockercfg located in your home directory. It supports multiple registry urls.
</p>
<p>
docker login will create the “<a href="https://index.docker.io/v1/">https://index.docker.io/v1/</a>” key.
</p>
<p>
docker login <a href="https://my-registry.com">https://my-registry.com</a> will create the “<a href="https://my-registry.com">https://my-registry.com</a>” key.
</p>
<p>
For example:
</p>


<pre class="src src-JASON">{
     <span style="color: #8b2252;">"https://index.docker.io/v1/"</span>: {
             <span style="color: #8b2252;">"auth"</span>: <span style="color: #8b2252;">"xXxXxXxXxXx="</span>,
             <span style="color: #8b2252;">"email"</span>: <span style="color: #8b2252;">"email@example.com"</span>
     },
     <span style="color: #8b2252;">"https://my-registry.com"</span>: {
             <span style="color: #8b2252;">"auth"</span>: <span style="color: #8b2252;">"XxXxXxXxXxX="</span>,
             <span style="color: #8b2252;">"email"</span>: <span style="color: #8b2252;">"email@my-registry.com"</span>
     }
}
</pre>

<p>
The auth field represents base64(&lt;username&gt;:&lt;password&gt;)
</p>
</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Build your own base image</h3>
<div class="outline-text-3" id="text-2-3">

<p>Docker.io provides a way to create a <a href="http://docs.docker.io/en/latest/articles/baseimages/">base image</a>. The base image heavily depends on the distribution, the host is running. The example script <a href="https://github.com/dotcloud/docker/blob/master/contrib/mkimage-debootstrap.sh">mkimage-debootstrap.sh</a> creates a debian base image.
</p>
</div>
