docs/docker.docu.org
*** Download the script
#+BEGIN_SRC sh
$ wget https://raw.github.com/dotcloud/docker/master/contrib/mkimage-debootstrap.sh
$ chmod +x mkimage-debootstrap.sh
#+END_SRC
This downloads the build-script for a debian docker base image.
*** Build the base image
#+BEGIN_SRC sh
$ ./mkimage-debootstrap.sh flora/debian wheezy 
$ docker images -a
#+END_SRC
This creates a new docker base image for debain wheezy and puts it into ropsitory /flora/debian/, where /flora/ is the username and /debian/ the repo name.
* Installing a /Scala/Java/ WebApp
As a proof of concept, we install a /Scala/ WebApp with /Lift/. We need /Java/ version > 6 and we use /Lift/ as the framework. 
** Installing /Java/ and /Lift/
*** The necessary debian packages
We need /jdk/ at least version 6, /wegt/ and /zip/:
#+BEGIN_SRC sh
$ apt-get install -y openjdk-7-jre
$ apt-get install -y openjdk-7-jdk
$ apt-get install -y wget
$ apt-get install -y zip
#+END_SRC
This installs Java 7 and my take a minute.
*** TODO check if we need apache packages?
*** Scala WebApp
We download and configure a sample /Scala/ WebApp and generate the War-file.
#+BEGIN_SRC sh
$ cd /opt
$ wget https://github.com/Lift/Lift_26_sbt/archive/master.zip
$ unzip master.zip
$ cd lift_26_sbt-master/scala_210/lift_basic/
$ ./sbt  compile
$ ./sbt  package
#+END_SRC 
[[http:///Lift/web.net/getting_started][/Lift/ web framework]]  will download /sbt/, /Scala/ and the necessary dependencies and compile the War-File */opt/lift\_26\_sbt-master/scala\_210/lift\_basic/target/scala-2.10/lift-2.6-starter-template_2.10-0.0.3.war*. By typing
#+BEGIN_SRC sh
$ ./sbt 
> start
#+END_SRC
we should be able to see the WebApp at [[http://localhost:8080]]. To exit just type =exit=. The source of this WebApp is under */opt/lift\_26\_sbt-master/scala\_210/lift\_basic/src/main/webapp/*. To prove the concept, we will later just change /index.html/.
** Installing /tomcat7/
We use /tomcat/ as the *Apache Tomcat Servlet/JSP* engine to serve our /Scala/ WebApp, installing it by typing:
#+BEGIN_SRC sh
$ apt-get install tomcat7 
#+END_SRC  
Tomcat serves servlets  at [[http://localhost:8080]]. The debian package starts the service automatically at boot time via /etc/init.d/tomcat7/ script.
** Deploying the WebApp to /tomcat7/
/Lift/ uses /sbt/ to compile the project and output a WAR- or JAR-file, which we want to copy into /tomcat7/'s webapp directory */var/lib/tomcat7/webapps/*. We recompile the package and deploy it statically into /tomcat/.
#+BEGIN_SRC sh 
$ cd /opt/lift_26_sbt-master/scala_210/lift_basic/
$  ./sbt  package
$ cp  target/scala-2.10/lift-2.6-starter-template_2.10-0.0.3.war \
    /var/lib/tomcat7/webapps/lift.war
$ service tomcat7 restart
#+END_SRC 
This copies the war-file and restarts /tomcat7/. To see the WebApp direct your browser to [[http://localhost:8080/lift_basic/]]. There is no need to restart /tomcat/ manually, as the /autoDeploy/ attribute is set to "true" in file */etc/tomcat7/server.xml*. /tomcat/ even unpacks war-files if attribute /unpackWARs/ is set to "true".
* Installing Jenkinsx
How to install a jenkins server
* Configure Jenkins to publish a container into the registry

Each time the WebApp has changed in git, Jenkins builds a new container,  consisting of three parts:
1. Deploying the WebApp-Files into the latest container.
2. Commit the newly build container and tag it properly.
3. Start the newly taged container.
