docs/docker.docu.html

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Download the script</h4>
<div class="outline-text-4" id="text-2-3-1">




<pre class="src src-sh">$ wget https://raw.github.com/dotcloud/docker/master/contrib/mkimage-debootstrap.sh
$ chmod +x mkimage-debootstrap.sh
</pre>

<p>
This downloads the build-script for a debian docker base image.
</p></div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Build the base image</h4>
<div class="outline-text-4" id="text-2-3-2">




<pre class="src src-sh">$ ./mkimage-debootstrap.sh flora/debian wheezy 
$ docker images -a
</pre>

<p>
This creates a new docker base image for debain wheezy and puts it into ropsitory <i>flora/debian</i>, where <i>flora</i> is the username and <i>debian</i> the repo name.
</p></div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installing a <i>Scala/Java</i> WebApp</h2>
<div class="outline-text-2" id="text-3">

<p>As a proof of concept, we install a <i>Scala</i> WebApp with <i>Lift</i>. We need <i>Java</i> version &gt; 6 and we use <i>Lift</i> as the framework. 
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Installing <i>Java</i> and <i>Lift</i></h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> The necessary debian packages</h4>
<div class="outline-text-4" id="text-3-1-1">

<p>We need <i>jdk</i> at least version 6, <i>wegt</i> and <i>zip</i>:
</p>


<pre class="src src-sh">$ apt-get install -y openjdk-7-jre
$ apt-get install -y openjdk-7-jdk
$ apt-get install -y wget
$ apt-get install -y zip
</pre>

<p>
This installs Java 7 and my take a minute.
</p></div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> <span class="todo TODO">TODO</span> check if we need apache packages?</h4>
<div class="outline-text-4" id="text-3-1-2">

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Scala WebApp</h4>
<div class="outline-text-4" id="text-3-1-3">

<p>We download and configure a sample <i>Scala</i> WebApp and generate the War-file.
</p>


<pre class="src src-sh">$ cd /opt
$ wget https://github.com/Lift/Lift_26_sbt/archive/master.zip
$ unzip master.zip
$ cd lift_26_sbt-master/scala_210/lift_basic/
$ ./sbt  compile
$ ./sbt  package
</pre>

<p>
<a href="http:///Lift/web.net/getting_started"><i>Lift</i> web framework</a>  will download <i>sbt</i>, <i>Scala</i> and the necessary dependencies and compile the War-File <b>/opt/lift_26_sbt-master/scala_210/lift_basic/target/scala-2.10/lift-2.6-starter-template<sub>2</sub>.10-0.0.3.war</b>. By typing
</p>


<pre class="src src-sh">$ ./sbt 
&gt; start
</pre>

<p>
we should be able to see the WebApp at <a href="http://localhost:8080">http://localhost:8080</a>. To exit just type <code>exit</code>. The source of this WebApp is under <b>/opt/lift_26_sbt-master/scala_210/lift_basic/src/main/webapp/</b>. To prove the concept, we will later just change <i>index.html</i>.
</p></div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Installing <i>tomcat7</i></h3>
<div class="outline-text-3" id="text-3-2">

<p>We use <i>tomcat</i> as the <b>Apache Tomcat Servlet/JSP</b> engine to serve our <i>Scala</i> WebApp, installing it by typing:
</p>


<pre class="src src-sh">$ apt-get install tomcat7 
</pre>

<p>
Tomcat serves servlets  at <a href="http://localhost:8080">http://localhost:8080</a>. The debian package starts the service automatically at boot time via <i>etc/init.d/tomcat7</i> script.
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Deploying the WebApp to <i>tomcat7</i></h3>
<div class="outline-text-3" id="text-3-3">

<p><i>Lift</i> uses <i>sbt</i> to compile the project and output a WAR- or JAR-file, which we want to copy into <i>tomcat7</i>'s webapp directory <b>/var/lib/tomcat7/webapps/</b>. We recompile the package and deploy it statically into <i>tomcat</i>.
</p>


<pre class="src src-sh">$ cd /opt/lift_26_sbt-master/scala_210/lift_basic/
$  ./sbt  package
$ cp  target/scala-2.10/lift-2.6-starter-template_2.10-0.0.3.war <span style="color: #8b2252;">\</span>
    /var/lib/tomcat7/webapps/lift.war
$ service tomcat7 restart
</pre>

<p>
This copies the war-file and restarts <i>tomcat7</i>. To see the WebApp direct your browser to <a href="http://localhost:8080/lift_basic/">http://localhost:8080/lift<sub>basic</sub>/</a>. There is no need to restart <i>tomcat</i> manually, as the <i>autoDeploy</i> attribute is set to "true" in file <b>/etc/tomcat7/server.xml</b>. <i>tomcat</i> even unpacks war-files if attribute <i>unpackWARs</i> is set to "true".
</p></div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Installing Jenkinsx</h2>
<div class="outline-text-2" id="text-4">

<p>How to install a jenkins server
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Configure Jenkins to publish a container into the registry</h2>
<div class="outline-text-2" id="text-5">


<p>
Each time the WebApp has changed in git, Jenkins builds a new container,  consisting of three parts:
</p><ol>
<li>Deploying the WebApp-Files into the latest container.
</li>
<li>Commit the newly build container and tag it properly.
</li>
<li>Start the newly taged container.
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-02-19 18:26:26 CET</p>
<p class="author">Author: Michael Klöckner</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
